## Matching index between dataframe and selectors
- Trying to induce erors
- not managed yet to reproduce the error 'cannot reindex from a duplicate axis'

In [ ]:
import pandas as pd
import numpy as np

In [2]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})

data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [3]:
big_area_sel = data.area > 171000

In [4]:
ba = data[ big_area_sel ]
ba

              area       pop
California  423967  38332521
Texas       695662  26448193

In [5]:
ba [ ba['pop'] > 26500000 ]

              area       pop
California  423967  38332521

In [6]:
bp =  ba['pop'] > 26500000
ba[ bp ]

              area       pop
California  423967  38332521

In [7]:
# data[ bp ]

# error: 
# Unalignable boolean Series provided as indexer
# (index of the boolean Series and of the indexed object do not match

In [8]:
data[ big_area_sel ]

              area       pop
California  423967  38332521
Texas       695662  26448193

In [9]:
data.loc['California','area'] = 99999999
data

                area       pop
California  99999999  38332521
Texas         695662  26448193
New York      141297  19651127
Florida       170312  19552860
Illinois      149995  12882135

In [10]:
data[ big_area_sel ]

                area       pop
California  99999999  38332521
Texas         695662  26448193

### The index of the selector is the same as the index of the dataframe

In [11]:
big_area_sel.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [12]:
data.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [13]:
print( all( big_area_sel.index == data.index ))

True

In [14]:
new_row = {'area':123, 'pop':456}
data_local = data.copy()

# append row to the dataframe
# because dict is turned into a series with NO NAME (series name woudl be the df-row index)
# you can append only of you ignore_index 
# => strings will be reset to integers
data_local = data_local.append(new_row, ignore_index=True)
data_local

       area       pop
0  99999999  38332521
1    695662  26448193
2    141297  19651127
3    170312  19552860
4    149995  12882135
5       123       456

In [15]:
# otherwise you can cook up a Series, give it a name,
# and keep ignore_index=False

one_serie = data.xs('Texas')
one_serie.name = 'bananarep'
one_serie['area'] = 123
one_serie['pop']  = 456
one_serie

area    123
pop     456
Name: bananarep, dtype: int64

In [16]:
data = data.append(one_serie, ignore_index=False)
data

                area       pop
California  99999999  38332521
Texas            123       456
New York      141297  19651127
Florida       170312  19552860
Illinois      149995  12882135
bananarep        123       456

### at last the indices between the selector and the df are mis-aligned
Because I've added a row to the df

In [17]:
# big_area_sel.index == data.index
# gives error:
# ValueError: Lengths must match to compare


# data[big_area_sel]
# gives error
# Unalignable boolean Series provided as indexer
# (index of the boolean Series and of the indexed object do not match

In [18]:
anoth_serie = data.xs('Texas')
anoth_serie.name = 'bananarep'
anoth_serie['area'] = 798
anoth_serie['pop']  = 123
anoth_serie

area    798
pop     123
Name: bananarep, dtype: int64

In [19]:
data = data.append(one_serie, ignore_index=False)
data

                area       pop
California  99999999  38332521
Texas            798       123
New York      141297  19651127
Florida       170312  19552860
Illinois      149995  12882135
bananarep        123       456
bananarep        123       456

In [20]:
# data[big_area_sel]
# 
# same error as above
# Unalignable boolean Series provided as indexer
# (index of the boolean Series and of the indexed object do not match

/usr/local/bin/start_ipykernel.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match